#pragma once

#include <iostream>
#include <ctime>

/*
Класс полутоновых изображений произвольного размера. 
Типы данных, с которыми должен работать класс.
bool
char
float
short
Как минимум, предоставить:
• конструктор с параметрами: размеры изображения и флагом(True - матрица заполняется случайными значениями выбранного типа/ False – матрица заполняется нулями);
• оператор () для чтения/записи элемента по указанным индексам;
• операторы умножения * (поэлементное «И» для bool) и сложения + (поэлементное «ИЛИ» для bool) изображений;
• операторы умножения * и сложения + изображения на константу;
• оператор ! для инвертирования значений изображения(значение меняется на противоположное по модулю);
• вычисление коэффициента заполнения изображения(сумма значений матрицы/ (количество ячеек*максимальное значение заданного типа);

Инвертируйте все значения выше прямой, заданной парой координат (x1,y1)	и (x2,y2)
*/

















